# PointRelativeToPoint Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PointRelativeToPoint Methods
PointRelativeToPoint Class See Also
---
The PointRelativeToPoint type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetHostPointReference | Get a copy of the host point reference. |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| SetHostPointReference | Change the host point reference. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
PointRelativeToPoint Class
Autodesk.Revit.DB Namespace